[Basic Data Exploration](#basic-explor)

[Bivariate analysis](#bivar)

## Course Structure

1. Module 0 - Native Data Types in Python
2. Module 1 - Intro to Pandas library & Basis Dataframe attributes
3. Module 2 - Common Data manipulation tasks using Pandas
4. Module 3 - Loops and Functions 
5. Module 4 - Visualization
6. Module 5 - Other miscellaneous topics

# Basic data types

In [1]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [2]:
x = [1,"b",3]

In [3]:
x[1]

'b'

In [4]:
student_dict = {"s_1":["IBM","TCS"],"s_2" :["HP"], "s_3":["INFOSYS","WIPRO"]}

In [5]:
[val for k,val in student_dict.items()]

[['IBM', 'TCS'], ['HP'], ['INFOSYS', 'WIPRO']]

In [6]:
x = ["abe",1,"c"]

In [7]:
dist_ex = {"S1":["HCL","TCS"],"S2":["Benz"]}

In [8]:
for k,v in dist_ex.items():
    if k == "S1":
        print(k)

S1

In [9]:
x.append("h")

In [10]:
x

['abe', 1, 'c', 'h']

In [11]:
tup_ex = (1,2,3,1)

In [12]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\h.p\appdata\local\programs\python\python37\lib\site-packages (0.24.2)
Requirement already satisfied: numpy>=1.12.0 in c:\users\h.p\appdata\local\programs\python\python37\lib\site-packages (from pandas) (1.16.4)
Requirement already satisfied: pytz>=2011k in c:\users\h.p\appdata\local\programs\python\python37\lib\site-packages (from pandas) (2019.1)
Requirement already satisfied: python-dateutil>=2.5.0 in c:\users\h.p\appdata\local\programs\python\python37\lib\site-packages (from pandas) (2.8.0)
Requirement already satisfied: six>=1.5 in c:\users\h.p\appdata\roaming\python\python37\site-packages (from python-dateutil>=2.5.0->pandas) (1.12.0)

In [12]:
list_ex = [1,2,3]
dist_ex = {"Age":25,"Weight":70}

tup_ex = (1,2,3,1)

In [13]:
from pandas import read_csv

In [14]:
# read the data
import pandas as pd
import numpy as np
df = pd.read_csv("C:/Users/h.p/Desktop/python & ml/Reinforcement_learning/Uber_Drives_2016.csv")

In [15]:
df.head()

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,1/2/2016 1:25,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,1/2/2016 20:25,1/2/2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,1/5/2016 17:31,1/5/2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,1/6/2016 14:42,1/6/2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit

# Key Modules

1. Basic Dataframe operations
2. Common data manipulation tasks
3. Loops and Functions

## Basic dataframe operations

In [16]:
df.dtypes

START_DATE*     object
END_DATE*       object
CATEGORY*       object
START*          object
STOP*           object
MILES*         float64
PURPOSE*        object
dtype: object

In [17]:
df.shape

(1156, 7)

In [18]:
hasattr(df,"head")

True

In [19]:

callable(getattr(df,"head"))

True

In [20]:
df.tail()

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
1151,12/31/2016 13:24,12/31/2016 13:42,Business,Kar?chi,Unknown Location,3.9,Temporary Site
1152,12/31/2016 15:03,12/31/2016 15:38,Business,Unknown Location,Unknown Location,16.2,Meeting
1153,12/31/2016 21:32,12/31/2016 21:50,Business,Katunayake,Gampaha,6.4,Temporary Site
1154,12/31/2016 22:08,12/31/2016 23:51,Business,Gampaha,Ilukwatta,48.2,Temporary Site
1155,Totals,NaN,NaN,NaN,NaN,12204.7,NaN

In [21]:
df.dtypes

START_DATE*     object
END_DATE*       object
CATEGORY*       object
START*          object
STOP*           object
MILES*         float64
PURPOSE*        object
dtype: object

### Changing data types

In [22]:
temp = pd.DataFrame({"A":["1","2","3"],"B":[11,12,13],"C": ["12-06-2012","13-06-2015","15-06-2017"]})

In [23]:
temp.dtypes

A    object
B     int64
C    object
dtype: object

In [24]:
temp["C"] = pd.to_datetime(temp["C"])

In [25]:
temp["A"] = pd.to_numeric(temp["A"])

In [26]:
temp.dtypes

A             int64
B             int64
C    datetime64[ns]
dtype: object

In [27]:

temp["A"] = temp["A"].astype(str)

In [28]:
temp.dtypes

A            object
B             int64
C    datetime64[ns]
dtype: object

In [29]:
# convert data to datetime format

#pd.to_datetime(df["START_DATE*"] )
# Available time formats: https://docs.python.org/3/library/datetime.html#strftime-and-strptime-behavior

### Dataset summarization methods

In [30]:
df.describe(include="all")

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
count,1156,1155,1155,1155,1155,1156.000000,653
unique,1155,1154,2,177,188,NaN,10
top,6/28/2016 23:34,6/28/2016 23:59,Business,Cary,Cary,NaN,Meeting
freq,2,2,1078,201,203,NaN,187
mean,NaN,NaN,NaN,NaN,NaN,21.115398,NaN
std,NaN,NaN,NaN,NaN,NaN,359.299007,NaN
min,NaN,NaN,NaN,NaN,NaN,0.500000,NaN
25%,NaN,NaN,NaN,NaN,NaN,2.900000,NaN
50%,NaN,NaN,NaN,NaN,NaN,6.000000,NaN
75%,NaN,NaN,NaN,NaN,NaN,10.400000,NaN
max,NaN,NaN,NaN,NaN,NaN,12204.700000,NaN

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1156 entries, 0 to 1155
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   START_DATE*  1156 non-null   object
 1   END_DATE*    1155 non-null   object
 2   CATEGORY*    1155 non-null   object
 3   START*       1155 non-null   object
 4   STOP*        1155 non-null   object
 5   MILES*       1156 non-null   float64
 6   PURPOSE*     653 non-null    object
dtypes: float64(1), object(6)
memory usage: 63.3+ KB

In [32]:
# count of unique start locations
df["START*"].value_counts().head()

Cary                201
Unknown Location    148
Morrisville          85
Whitebridge          68
Islamabad            57
Name: START*, dtype: int64

## Common data manipulation tasks

5 verbs of data manipulation

1. Selecting/Indexing
2. Filtering
3. Sorting
4. Mutating/ Conditionally adding columns
5. Groupby/Summarize

### Select/Indexing

In [33]:
df.iloc[0:4,[0,3]]

      START_DATE*       START*
0  1/1/2016 21:11  Fort Pierce
1   1/2/2016 1:25  Fort Pierce
2  1/2/2016 20:25  Fort Pierce
3  1/5/2016 17:31  Fort Pierce

In [34]:
## Positional Indexing
df.iloc[0:4,[0,1]]

      START_DATE*       END_DATE*
0  1/1/2016 21:11  1/1/2016 21:17
1   1/2/2016 1:25   1/2/2016 1:37
2  1/2/2016 20:25  1/2/2016 20:38
3  1/5/2016 17:31  1/5/2016 17:45

In [35]:
df.iloc[0:4,0:3]

      START_DATE*       END_DATE* CATEGORY*
0  1/1/2016 21:11  1/1/2016 21:17  Business
1   1/2/2016 1:25   1/2/2016 1:37  Business
2  1/2/2016 20:25  1/2/2016 20:38  Business
3  1/5/2016 17:31  1/5/2016 17:45  Business

In [36]:
# label based indexing
df.loc[:,["START_DATE*","CATEGORY*"]].head()

      START_DATE* CATEGORY*
0  1/1/2016 21:11  Business
1   1/2/2016 1:25  Business
2  1/2/2016 20:25  Business
3  1/5/2016 17:31  Business
4  1/6/2016 14:42  Business

### In Class assignment

Extract first 5 rows and columns START_DATE* and MILES*

In [37]:
df.loc[:4,['START_DATE*','MILES*']]

      START_DATE*  MILES*
0  1/1/2016 21:11     5.1
1   1/2/2016 1:25     5.0
2  1/2/2016 20:25     4.8
3  1/5/2016 17:31     4.7
4  1/6/2016 14:42    63.7

### Filtering

In [38]:
df2 = df.loc[df["MILES*"] > 10,["MILES*"]]
df2.head()

    MILES*
4     63.7
9     16.5
10    10.8
22    15.1
23    11.2

In [39]:
df3 = df2.loc[0:3]
df3

Empty DataFrame
Columns: [MILES*]
Index: []

In [40]:
# find out all rides greater than 10 miles
df.loc[df["MILES*"] > 10].head()

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
4,1/6/2016 14:42,1/6/2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit
9,1/10/2016 12:17,1/10/2016 12:44,Business,Jamaica,New York,16.5,Customer Visit
10,1/10/2016 15:08,1/10/2016 15:51,Business,New York,Queens,10.8,Meeting
22,1/12/2016 16:02,1/12/2016 17:00,Business,New York,Queens County,15.1,Meeting
23,1/13/2016 13:54,1/13/2016 14:07,Business,Downtown,Gulfton,11.2,Meeting

In [41]:
# Find out all rides to Cary
df.loc[df["START*"]=="Cary",["MILES*"]].head()

    MILES*
7      0.8
8      8.3
28    10.4
30     4.8
34    17.1

In [42]:
# Find out all rides to Cary & Morrisville          
df[df["START*"].isin(["Cary","Morrisville"])].shape

(286, 7)

In [43]:
# Find out all rides to Cary & Morrisville          
df.loc[df["START*"].isin(["Cary","Morrisville"])].shape

(286, 7)

In [44]:
# Find out all rides not to Cary & Morrisville
df.loc[~df["START*"].isin(["Cary","Morrisville"])].shape

(870, 7)

#### In class assignment

1. Find all trips with distance > 10 miles and originating from Cary and Morris.

2. Extract top 3 rows from the filtered dataset

In [45]:
#Find all trips with distance > 10 miles and originating from Cary and Morris
df4 = df.loc[(df['MILES*']>10) & (df['START*'].isin(['Carry','Morrisville']))]
df4

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
97,2/12/2016 11:14,2/12/2016 11:35,Business,Morrisville,Raleigh,17.0,Customer Visit
100,2/12/2016 15:33,2/12/2016 16:06,Business,Morrisville,Cary,11.5,Customer Visit
388,5/28/2016 14:35,5/28/2016 15:04,Business,Morrisville,Cary,11.3,Customer Visit
545,7/14/2016 16:03,7/14/2016 16:34,Business,Morrisville,Morrisville,11.8,Errand/Supplies
546,7/14/2016 16:39,7/14/2016 20:05,Business,Morrisville,Banner Elk,195.3,NaN
587,7/22/2016 15:49,7/22/2016 16:22,Business,Morrisville,Cary,12.2,NaN
604,7/27/2016 21:34,7/27/2016 21:57,Business,Morrisville,Raleigh,14.7,NaN
884,10/31/2016 18:47,10/31/2016 19:16,Business,Morrisville,Raleigh,10.3,NaN

In [46]:
df4.loc[:2,]

Empty DataFrame
Columns: [START_DATE*, END_DATE*, CATEGORY*, START*, STOP*, MILES*, PURPOSE*]
Index: []

### Sorting

In [47]:
df.sort_values(by=["MILES*"],ascending=False).head(5)

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
1155,Totals,NaN,NaN,NaN,NaN,12204.7,NaN
269,3/25/2016 16:52,3/25/2016 22:22,Business,Latta,Jacksonville,310.3,Customer Visit
270,3/25/2016 22:54,3/26/2016 1:39,Business,Jacksonville,Kissimmee,201.0,Meeting
881,10/30/2016 15:22,10/30/2016 18:23,Business,Asheville,Mebane,195.9,NaN
776,9/27/2016 21:01,9/28/2016 2:37,Business,Unknown Location,Unknown Location,195.6,NaN

In [48]:
df.sort_values(by=["START*", "MILES*"],ascending=[True,False]).head(5)

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
906,11/4/2016 21:04,11/4/2016 21:20,Business,Agnew,Cory,4.3,NaN
911,11/6/2016 10:50,11/6/2016 11:04,Business,Agnew,Renaissance,2.4,NaN
908,11/5/2016 8:34,11/5/2016 8:43,Business,Agnew,Renaissance,2.2,NaN
910,11/5/2016 19:20,11/5/2016 19:28,Business,Agnew,Agnew,2.2,NaN
879,10/30/2016 12:58,10/30/2016 13:18,Business,Almond,Bryson City,15.2,NaN

### Conditionally adding columns

In [49]:
import numpy as np
df["miles_cat"] = np.where(df["MILES*"] > 5,"Long Trip","Short Trip")

In [50]:
df.head()

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*,miles_cat
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain,Long Trip
1,1/2/2016 1:25,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0,NaN,Short Trip
2,1/2/2016 20:25,1/2/2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies,Short Trip
3,1/5/2016 17:31,1/5/2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting,Short Trip
4,1/6/2016 14:42,1/6/2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit,Long Trip

In [51]:
df["miles_cat"].value_counts()

Long Trip     654
Short Trip    502
Name: miles_cat, dtype: int64

In [52]:
df.loc[df["MILES*"] > 5].shape

(654, 8)

## In class Assignment

Create a new column with the following condition:

a) > 10 - Long Trip

b) 5 - 10  - Medium

c) < 5 - Short Trip

In [59]:
df['new_miles'] = np.where(df['MILES*'] > 10,"Long Trip",np.where(df['MILES*'] < 5,"Short Trip","Medium Trip"))
df.head()

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*,miles_cat,new_miles
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain,Long Trip,Medium Trip
1,1/2/2016 1:25,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0,NaN,Short Trip,Medium Trip
2,1/2/2016 20:25,1/2/2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies,Short Trip,Short Trip
3,1/5/2016 17:31,1/5/2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting,Short Trip,Short Trip
4,1/6/2016 14:42,1/6/2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit,Long Trip,Long Trip

In [57]:
df['new_miles'].value_counts()

Short Trip     496
Medium Trip    344
Long Trip      316
Name: new_miles, dtype: int64

### Groupby Summarize

In [63]:
df.groupby("START*")["MILES*"]

In [64]:
# for each start loc find the mean distance travelled
df.groupby("START*")["MILES*"].agg("mean").head()

START*
Agnew         2.775000
Almond       15.200000
Apex          5.341176
Arabi        17.000000
Arlington     4.900000
Name: MILES*, dtype: float64

In [65]:
# for each start loc find the mean & the total dist travelled
df.groupby("START*").agg(["mean","sum"]).head()

              MILES*
                mean   sum
START*
Agnew       2.775000  11.1
Almond     15.200000  15.2
Apex        5.341176  90.8
Arabi      17.000000  17.0
Arlington   4.900000   4.9

### In class assignment

Find most recent & the earliest travelled date and mean distance traveled for each start city

## Loops and Function

In [66]:
# Basic for loop
res = []
temp = [1,2,3,4]
for i in temp:
    res.append(i*i)
res

[1, 4, 9, 16]

In [67]:
# List comprehension way

[x*x for x in temp]

[1, 4, 9, 16]

In [15]:
store_sales = pd.read_csv("C:/Users/h.p/Desktop/python & ml/Reinforcement_learning/store_sales.csv")

In [16]:
store_sales.head()

,store_id,city,Jan,Feb,Mar,Apr,May,Jun,July,Aug,Sep,Oct,Nov,Dec
0,S_1,Texas,8,20,13,21,17,20,24,17,16,9,7,6
1,S_2,California,12,19,15,15,11,19,7,15,10,11,21,19
2,S_3,California,16,16,14,19,23,6,13,13,15,14,24,8
3,S_4,Texas,8,18,13,10,14,14,6,8,8,18,7,11
4,S_5,Texas,19,5,24,9,5,24,10,5,24,15,6,13

In [17]:
# find out avg sales for each month
for i in range(store_sales.shape[1]-2):      #scratch method
    print(f"Avg sales for {store_sales.columns[i+2]} is ",store_sales.iloc[:,i+2].mean())
    
store_sales.mean(axis=0)    #pandas method


# find out avg sales for each store
store_sales.mean(axis=1)

Avg sales for Jan is  14.46
Avg sales for Feb is  15.09
Avg sales for Mar is  14.56
Avg sales for Apr is  14.57
Avg sales for May is  13.56
Avg sales for Jun is  13.8
Avg sales for July is  14.38
Avg sales for Aug is  15.81
Avg sales for Sep is  14.91
Avg sales for Oct is  14.1
Avg sales for Nov is  15.31
Avg sales for Dec is  13.57

Jan     14.46
Feb     15.09
Mar     14.56
Apr     14.57
May     13.56
Jun     13.80
July    14.38
Aug     15.81
Sep     14.91
Oct     14.10
Nov     15.31
Dec     13.57
dtype: float64

0     14.833333
1     14.500000
2     15.083333
3     11.250000
4     13.250000
        ...
95    15.416667
96    12.833333
97    14.000000
98    14.416667
99    15.000000
Length: 100, dtype: float64

In [18]:
def bonus_func(sales_numbers):
    return ["Eligible" if x > 15 else "Not Eligible" for x in sales_numbers]

In [19]:
bonus_func([12,23,56])

['Not Eligible', 'Eligible', 'Eligible']

In [20]:
store_sales.iloc[:,2:].apply(bonus_func).head()

,Jan,Feb,Mar,Apr,May,Jun,July,Aug,Sep,Oct,Nov,Dec
0,Not Eligible,Eligible,Not Eligible,Eligible,Eligible,Eligible,Eligible,Eligible,Eligible,Not Eligible,Not Eligible,Not Eligible
1,Not Eligible,Eligible,Not Eligible,Not Eligible,Not Eligible,Eligible,Not Eligible,Not Eligible,Not Eligible,Not Eligible,Eligible,Eligible
2,Eligible,Eligible,Not Eligible,Eligible,Eligible,Not Eligible,Not Eligible,Not Eligible,Not Eligible,Not Eligible,Eligible,Not Eligible
3,Not Eligible,Eligible,Not Eligible,Not Eligible,Not Eligible,Not Eligible,Not Eligible,Not Eligible,Not Eligible,Eligible,Not Eligible,Not Eligible
4,Eligible,Not Eligible,Eligible,Not Eligible,Not Eligible,Eligible,Not Eligible,Not Eligible,Eligible,Not Eligible,Not Eligible,Not Eligible

In [21]:
store_sales.iloc[:,2:].apply(lambda sales_numbers: ["Eligible" if x > 15 else "Not Eligible" for x in sales_numbers]).head()

,Jan,Feb,Mar,Apr,May,Jun,July,Aug,Sep,Oct,Nov,Dec
0,Not Eligible,Eligible,Not Eligible,Eligible,Eligible,Eligible,Eligible,Eligible,Eligible,Not Eligible,Not Eligible,Not Eligible
1,Not Eligible,Eligible,Not Eligible,Not Eligible,Not Eligible,Eligible,Not Eligible,Not Eligible,Not Eligible,Not Eligible,Eligible,Eligible
2,Eligible,Eligible,Not Eligible,Eligible,Eligible,Not Eligible,Not Eligible,Not Eligible,Not Eligible,Not Eligible,Eligible,Not Eligible
3,Not Eligible,Eligible,Not Eligible,Not Eligible,Not Eligible,Not Eligible,Not Eligible,Not Eligible,Not Eligible,Eligible,Not Eligible,Not Eligible
4,Eligible,Not Eligible,Eligible,Not Eligible,Not Eligible,Eligible,Not Eligible,Not Eligible,Eligible,Not Eligible,Not Eligible,Not Eligible

In [22]:
store_sales.columns

Index(['store_id', 'city', 'Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'July',
       'Aug', 'Sep', 'Oct', 'Nov', 'Dec'],
      dtype='object')

In [23]:
store_sales.groupby("city").agg("mean")

,Jan,Feb,Mar,Apr,May,Jun,July,Aug,Sep,Oct,Nov,Dec
city,,,,,,,,,,,,
Arizona,15.500000,15.272727,14.545455,14.954545,14.090909,15.090909,14.636364,15.500000,15.318182,14.954545,16.409091,13.318182
California,14.744186,15.534884,14.627907,13.976744,13.255814,13.697674,14.813953,16.232558,14.883721,14.279070,15.279070,13.604651
Texas,13.457143,14.428571,14.485714,15.057143,13.600000,13.114286,13.685714,15.485714,14.685714,13.342857,14.657143,13.685714

### Assignments

1) Find mean quarterly sales by store

2) Find the month with highest sales for each store

## Other/Miscellaneous topics

### Missing value treatment

In [26]:
df.isnull().sum()

START_DATE*      0
END_DATE*        1
CATEGORY*        1
START*           1
STOP*            1
MILES*           0
PURPOSE*       503
dtype: int64

In [27]:
## Count missing values
df.isnull().sum()

START_DATE*      0
END_DATE*        1
CATEGORY*        1
START*           1
STOP*            1
MILES*           0
PURPOSE*       503
dtype: int64

In [28]:
# Fill NA with most common values
df["PURPOSE*"].value_counts()

Meeting            187
Meal/Entertain     160
Errand/Supplies    128
Customer Visit     101
Temporary Site      50
Between Offices     18
Moving               4
Airport/Travel       3
Commute              1
Charity ($)          1
Name: PURPOSE*, dtype: int64

In [29]:
df = df.fillna({"PURPOSE*":"Meeting"})

In [30]:
df["PURPOSE*"].value_counts()

Meeting            690
Meal/Entertain     160
Errand/Supplies    128
Customer Visit     101
Temporary Site      50
Between Offices     18
Moving               4
Airport/Travel       3
Commute              1
Charity ($)          1
Name: PURPOSE*, dtype: int64

### Matrix operations use case

### Example 1 - compute month on month growth in sales

In [31]:
store_sales.head()

,store_id,city,Jan,Feb,Mar,Apr,May,Jun,July,Aug,Sep,Oct,Nov,Dec
0,S_1,Texas,8,20,13,21,17,20,24,17,16,9,7,6
1,S_2,California,12,19,15,15,11,19,7,15,10,11,21,19
2,S_3,California,16,16,14,19,23,6,13,13,15,14,24,8
3,S_4,Texas,8,18,13,10,14,14,6,8,8,18,7,11
4,S_5,Texas,19,5,24,9,5,24,10,5,24,15,6,13

In [32]:
sales_mat = np.array(store_sales.iloc[:,2:])

In [33]:
sales_mat

array([[ 8, 20, 13, ...,  9,  7,  6],
       [12, 19, 15, ..., 11, 21, 19],
       [16, 16, 14, ..., 14, 24,  8],
       ...,
       [16,  9,  6, ..., 22, 17, 22],
       [18, 16,  9, ..., 17, 19, 10],
       [ 5, 23, 17, ..., 20,  5,  9]], dtype=int64)

In [34]:
sales_mat_lag = sales_mat[:,1:]
sales_mat_lag

array([[20, 13, 21, ...,  9,  7,  6],
       [19, 15, 15, ..., 11, 21, 19],
       [16, 14, 19, ..., 14, 24,  8],
       ...,
       [ 9,  6, 14, ..., 22, 17, 22],
       [16,  9,  5, ..., 17, 19, 10],
       [23, 17, 24, ..., 20,  5,  9]], dtype=int64)

In [35]:
sales_mat_lag = sales_mat[:,1:]
sales_mat_lag = np.c_[sales_mat_lag,np.zeros(100)]

In [36]:
sales_diff = sales_mat_lag - sales_mat

In [37]:
perct_change = pd.DataFrame(sales_diff/sales_mat)

In [38]:
perct_change.head()

,0,1,2,3,4,5,6,7,8,9,10,11
0,1.500000,-0.350000,0.615385,-0.190476,0.176471,0.200000,-0.291667,-0.058824,-0.437500,-0.222222,-0.142857,-1.0
1,0.583333,-0.210526,0.000000,-0.266667,0.727273,-0.631579,1.142857,-0.333333,0.100000,0.909091,-0.095238,-1.0
2,0.000000,-0.125000,0.357143,0.210526,-0.739130,1.166667,0.000000,0.153846,-0.066667,0.714286,-0.666667,-1.0
3,1.250000,-0.277778,-0.230769,0.400000,0.000000,-0.571429,0.333333,0.000000,1.250000,-0.611111,0.571429,-1.0
4,-0.736842,3.800000,-0.625000,-0.444444,3.800000,-0.583333,-0.500000,3.800000,-0.375000,-0.600000,1.166667,-1.0

### Example 1 - compute net revenue

In [39]:
profit_mat = np.random.uniform(low=0.05, high=0.25, size=(100,12))

In [40]:
## Find total annual profit for each store
profit_mat = profit_mat.transpose()

In [41]:
profit_mat.shape

(12, 100)

In [42]:
prof_matrix = np.dot(sales_mat,profit_mat)

In [43]:
prof_matrix.shape

(100, 100)